Repository: Salah-E-Messaoudi/padel
Catalog: lib/src/localization/app_*.arb
Languages: ar

# appTitle
source: Padel Life
ar: Padel Park

# onboarding_title_1
source: Searching For Padel Stadiums
ar: البحث عن ملاعب باديل

# onboarding_title_2
source: So You Are In The Right Place
ar: إذن أنت في المكان المناسب

# onboarding_title_3
source: Invite Your Friends To The Game
ar: قم بدعوة أصدقائك إلى اللعبة

# onboarding_subtitle_1
source: Are You Trying To Find A Professional Padel Stadiums For Booking To Join With Your Team And Have Fun Together?
ar: هل تحاول العثور على ملاعب محترفة للحجز للانضمام إلى فريقك والاستمتاع معًا؟

# onboarding_subtitle_2
source: We Provide You A List Of Choices So You Can Book The Padel Stadium And The Time You Want Just From Your Phone
ar: نقدم لك قائمة بالاختيارات حتى تتمكن من حجز الملعب والوقت الذي تريده فقط من هاتفك

# onboarding_subtitle_3
source: Add Your Friends And Invite Them To Join To Your Padel Games And Have Fun Together
ar: أضف أصدقائك وادعهم للانضمام إلى ألعابك والاستمتاع معًا

source: Next
ar: التالي

source: Get Started
ar: البدء

# auth_title
source: Let's sign you in
ar: دعنا نسجل دخولك

# auth_subtitle
source: Sign in with your phone number We will send you a 5 digits verification code
ar: سجّل الدخول باستخدام رقم هاتفك سنرسل لك رمز تحقق مكونًا من 5 أرقام

source: Authentication failed
ar: فشلت عملية المصادقة

source: Credential already in use
ar: بيانات التسجيل قيد الاستخدام بالفعل

# invalid_continue_uri
source: Continue URL is invalid
ar: عنوان URL للمتابعة غير صالح

# invalid_credential
source: Credential is not valid
ar: بيانات التسجيل غير صالحة

source: Invalid phone number
ar: رقم هاتف غير صحيح!

# invalid_verification_code
source: Verification code is not valid
ar: رمز التحقق غير صالح

# invalid_verification_id
source: Verification ID is not valid
ar: معرف التحقق غير صالح

# network_request_failed
source: Check your internet connection
ar: يُرجى التحقُّق من اتصال الإنترنت.

source: Operation not allowed
ar: العملية غير مسموح بها.

# provider_already_linked
source: Credential already in use
ar: بيانات التسجيل قيد الاستخدام بالفعل

# quota_exceeded
source: SMS quota has been exceeded
ar: تم تجاوز حصة الرسائل القصيرة

# requires_recent_login
source: Recent login is required
ar: تسجيل الدخول الأخير مطلوب

# requires_recent_login_body
source: Session expired: Recent login is required, please login and try again.
ar: انتهت صلاحية الجلسة: تسجيل الدخول الأخير مطلوب، يرجى تسجيل الدخول والمحاولة مرة أخرى..

# too_many_requests
source: Too many attempts to sign in
ar: عدد كبير جدًا من المحاولات لتسجيل الدخول

# user_disabled
source: Account has been disabled
ar: Aتم تعطيل الحساب.

# user_mismatch
source: Credential does not correspond to the user
ar: بيانات الاعتماد لا تتوافق مع المستخدم

source: User not found
ar: لم يتم العثور على المستخدم

# unknown_error
source: Something went wrong! try again
ar: حدث خطأ. يُرجى إعادة المحاولة

# app_not_authorized
source: An invalid safety Net token was passed
ar: تم تمرير رمز شبكة أمان غير صالح

# require_validation
source: Account requires validation
ar: يتطلب الحساب التحقق

source: Location services
ar: خدمات تحديد الموقع

# location_denied_forever
source: Location permissions are permanently denied, we cannot request permissions.
ar: تم رفض أذونات تحديد الموقع بشكل دائم، لا يمكننا طلب الأذونات.

# location_denied
source: Location permissions are denied
ar: تم رفض أذونات تحديد الموقع

# location_services_disabled
source: Location services are disabled.
ar: Lخدمات الموقع معطلة.

# pick_image
source: Pick your profile picture!
ar: اختر صورة ملفك الشخصي!

# pick_gender
source: Pick your gender!
ar: اختر جنسك!

source: Invalid request
ar: طلب غير صالح.

# already_friends
source: Your are already friends
ar: لديك بالفعل أصدقاء

# didnt_receive_code
source: Didn't receive your code ?
ar: لم تستلم الرمز الخاص بك؟

source: Resend
ar: إعادة الإرسال

source: Phone Number
ar: رقم الهاتف

source: Change Phone Number
ar: تغيير رقم الهاتف

# phone_number_hint
source: Enter Your Phone Number
ar: أدخل رقم هاتفك

source: SUBMIT
ar: ارسل

source: SIGN IN
ar: تسجل الدخول

# setup_account
source: Setup your account
ar: قم بإعداد حسابك

# setup_account_subtitle
source: Complete your profile This information will appear to your friends
ar: أكمل ملف التعريف الخاص بك س تظهر هذه المعلومات لأصدقائك

source: Full name
ar: الاسم بالكامل

# full_name_hint
source: Enter Your Full Name
ar: أدخِل اسمك بالكامل

# age
source: How old are you?
ar: تاريخ الميلاد

# age_hint
source: Enter Your Age
ar: اختيار التاريخ

# gender
source: Pick your gender?
ar: اختر جنسك

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Field required
ar: حقل مطلوب

# hi
source: Hi {name}
ar: أهلا {name}

# kdw_hour
source: /hour
ar: /ساعة

source: {price} KDW
ar: {price} دينار كويتي

# stadiums_subtitle
source: Let's Book A Stadium And Plan Our Game
ar: لنحجز ملعب ونخطط لعبتنا

# categories
source: You want to book
ar: تريد أن تحجز

source: All
ar: الكل

source: Padel
ar: بادل

source: {type} match
ar: {type} مباراة

source: Football
ar: كرة قدم

# available_stadiums
source: Available Stadium
ar: الملاعب المتاحة

# bookings_title
source: Check Your Booking's
ar: تحقق من حجزك

# bookings_subtitle
source: See All Your Active And Recent Booking
ar: شاهد جميع الحجوزات النشطة والحديثة

source: Notification
ar: إشعار

# notification_padel_invitation
source: has invited you to join him into a Padel match on
ar: قد دعاك للانضمام إليه في مباراة بادل على

# notification_football_invitation
source: has invited you to join him into a football match on
ar: قد دعاك للانضمام إليه في مباراة كرة قدم على

# notification_padel_invitation_accept
source: accept your invitation to Padel match in
ar: قبول دعوتك لمباراة بادل في

# notification_football_invitation_accept
source: accept your invitation to football match in
ar: قبول دعوتك لمباراة كرة القدم في

# notification_padel_invitation_reject
source: accept your invitation to Padel match in
ar: قبول دعوتك لمباراة بادل في

# notification_football_invitation_reject
source: accept your invitation to football match in
ar: قبول دعوتك لمباراة كرة القدم في

source: This Week
ar: هذا الاسبوع

source: Selected Date :
ar: : التاريخ المحدَّد

source: Select Date
ar: حدد التاريخ

source: BOOK NOW
ar: احجز الآن

source: Accept
ar: قبول

source: Reject
ar: رفض

source: Details
ar: تفاصيل

source: Owner
ar: المنظم

source: Time
ar: الوقت

source: Date
ar: التاريخ

source: Team Members
ar: أعضاء الفريق

source: Members
ar: الأعضاء

# add_new_member
source: Add New Members
ar: إضافة أعضاء جدد

# look_stadium
source: Take a look at the stadium
ar: ألق نظرة على الملعب

source: Profile
ar: الملف الشخصي

source: Notifications
ar: الإشعارات

source: My Friends
ar: أصدقائي

source: Invite Friends
ar: دعوة الأصدقاء

# pending_invitation
source: Pending Invitations
ar: دعوات مُعلّقة

source: Play System
ar: نظام اللعب

source: Log Out
ar: تسجيل الخروج

# user_gender
source: Gender
ar: الجنس

# user_age
source: Age
ar: العمر

source: Edit Profile
ar: تعديل الملف الشخصي

source: Save Profile
ar: حفظ الملف الشخصي

source: Add New Friend
ar: إضافة صديق جديد

# add_new_friend_subtitle
source: Enter Your Friend Phone Number, or add from your contects list.
ar: أدخل رقم هاتف صديقك، أو أضف من قائمة جهات الإتصال الخاصة بك.

# select_contact
source: Select a contact from the list bellow to copy his number
ar: حدد جهة اتصال من القائمة أدناه لنسخ رقمه

# add_friends
source: Add Friend
ar: إضافة صديق

source: Invite From
ar: دعوة من

source: Event
ar: فَعالية

source: Date Time
ar: التاريخ والوقت

source: Team
ar: الفريق

source: {number} joined
ar: {number} تم الإنضمام

# friend_added_1
source: added you to his friends list, now you can invite each other to matches.
ar: أضافك إلى قائمة أصدقائه, الآن يمكنك دعوة بعضكما البعض إلى المباريات.

# friend_added_2
source: added to your friends list, now you can invite each other to matches to complete your team.
ar: إضافة إلى قائمة أصدقائك، يمكنك الآن دعوة بعضكما البعض إلى المباريات لإكمال فريقك.

# friend_added_3
source: added you to his friends list, now you can invite each other to matches to complete your team.
ar: أضافك إلى قائمة أصدقائه، والآن يمكنك دعوة بعضكما البعض إلى المباريات لإكمال فريقك.

# new_invitation
source: invited you to a match to complete his team.
ar: دعوتك إلى مباراة لإكمال فريقه.

# invitation_accepted
source: has accepted your invitation and joined your team.
ar: قبلت دعوتك وانضمت إلى فريقك.

source: Confirmation
ar: تأكيد

# alert_accept_invit_subtitle
source: Would like to accept this invitation and join the match?
ar: هل ترغب في قبول هذه الدعوة والانضمام إلى المباراة؟

# alert_reject_invit_subtitle
source: Would like to reject and delete this invitation?
ar: Wهل ترغب في رفض هذه الدعوة وحذفها؟

# alert_signout_title
source: Sign out!
ar: تسجيل الخروج

# alert_signout_subtitle
source: Are you sure you want to sign out and close your account?
ar: هل تريد بالتأكيد تسجيل الخروج وإغلاق حسابك؟

# alert_updateprofile_title
source: Update profile!
ar: تحديث الملف الشخصي

# alert_updateprofile_subtitle
source: Are you sure you want to update your personnel information?
ar: هل أنت متأكد من أنك تريد تحديث معلومات الموظفين الخاصة بك؟

# alert_booking_confirmation_title
source: Confirm your booking
ar: قم بتأكيد الحجز

# alert_booking_confirmation_subtitle
source: Are you sure you want to book this stadium with selected date and time?
ar: هل أنت متأكد من أنك تريد حجز هذا الملعب مع التاريخ والوقت المحددين؟

# alert_invite_friend_title
source: Invite to match
ar: دعوة لمباراه

# alert_invite_friend_subtitle
source: Would like to send this user an invitation to join this match?
ar: هل ترغب في إرسال دعوة لهذا المستخدم للانضمام إلى هذه المباراة؟

# alert_add_friend_subtitle
source: Would you like to add this user to your friends list?
ar: هل ترغب في إضافة هذا المستخدم إلى قائمة أصدقائك؟

# alert_delete_all_notifications_title
source: Delete all!
ar: حذف الكل

# alert_delete_all_notifications_subtitle
source: Are you sure you want to delete all notifications displayed here?
ar: هل تريد بالتأكيد حذف جميع الإشعارات المعروضة هنا؟

# alert_send_invitation_title
source: Share your invitation
ar: مشاركة دعوتك

# alert_send_invitation_subtitle
source: No user with this phone number has been found. Would you like to tell your friend about Padel Life ?
ar: لم يتم العثور على مستخدم برقم الهاتف هذا. هل ترغب في إخبار صديقك عن Padel Park؟

# alert_share_invitation
source: Hi, come check this amazing app Padel Life, we can book sessions and invite friends to complete our team. Download from the store using the link bellow. https://example.com.
ar: مرحبًا، تعال وتحقق من هذا التطبيق المذهل Padel Park، يمكننا حجز الجلسات ودعوة الأصدقاء لإكمال فريقنا. قم بالتنزيل من المتجر باستخدام الرابط أدناه. https://padellife.co.

source: Stadiums
ar: ملاعب

source: Bookings
ar: الحجوزات

source: Update completed!
ar: اكتمل التحديث

source: Session booked successfully!
ar: تم حجز الملعب بنجاح!

source: Invitation sent successfully!
ar: تم إرسال الدعوة بنجاح!

source: Invitation accepted successfully!
ar: تم قبول الدعوة!

source: Invitation rejected successfully!
ar: تم رفض الدعوة !

# friend_added_successfully
source: User added to friends list!
ar: تمت إضافة المستخدم إلى قائمة الأصدقاء!

# complete_booking
source: Please select date and a session!
ar: الرجاء تحديد التاريخ و الوقت!

source: Pick your session
ar: اختر وقتك

# empty_bookings
source: You have no bookings at this moment. All your future bookings will be listed here.
ar: ليس لديك حجوزات في هذه اللحظة. سيتم سرد جميع حجوزاتك المستقبلية هنا.

# empty_stadiums
source: At this moment there are no stadiums for selected option, try another option or try later.
ar: في هذه اللحظة لا توجد ملاعب للخيار المحدد، جرب خيارًا آخر أو حاول لاحقًا.

# empty_notifications
source: You have no notfications for now, a red circle will be displayed on top of the notification button on the mainscreen to notify you.
ar: ليس لديك إشعارات في الوقت الحالي، سيتم عرض دائرة حمراء أعلى زر الإعلام على الشاشة الرئيسية لإعلامك.

# empty_friends_myfriends
source: You have no friends at this moment. Add a friend to Padel Life platforme using his/her phone number.
ar: ليس لديك أصدقاء في هذه اللحظة. أضف صديقًا إلى منصة Padel Park باستخدام رقم هاتفه.

# empty_pending_invitations
source: Your friends can bool stadiums and invite you to join their match. Your invitations will be displayed here.
ar: يمكن لأصدقائك استعراض الملاعب المتاحة ودعوتك للانضمام إلى مباراتهم. سيتم عرض دعواتك هنا.

# empty_friends_invite
source: You have no friends at this moment. From the side menu, on my friends option, add users to your friends list using phone number.
ar: ليس لديك أصدقاء في هذه اللحظة. من القائمة الجانبية، على خيار أصدقائي، أضف مستخدمين إلى قائمة أصدقائك باستخدام رقم الهاتف.

source: Session already taken!
ar: هذا الوقت محجوز بالفعل!

source: Invited
ar: مدعو

source: Added
ar: تمت الإضافة

source: Invite
ar: دعوة

source: Close
ar: إغلاق

source: cancel
ar: إلغاء

source: Yes
ar: نعم
